In [1]:
import numpy as np
import pandas as pd
from Bio import SeqIO
from Bio.Data import CodonTable

In [53]:
pd.__version__

'2.0.0'

In [4]:
x = {1: 2, 3: 4}

In [5]:
pd.Series(x)

1    2
3    4
dtype: int64

In [8]:
x = pd.Series({'ATG': 1, 'CGG': 1, 'ACG': 1, 'TAC': 1, 'GTA': 1, 'CGT': 1})
y = pd.Series({'ATG': 1, 'CGG': 2, 'AGG': 1, 'TAC': 1, 'GTA': 1, 'CGT': 1})

In [7]:
x

ATG    1
CGG    1
ACG    1
TAC    1
GTA    1
CGT    1
dtype: int64

In [11]:
df = pd.concat([x, y], axis=1)

In [12]:
df.transpose()

   ATG  CGG  ACG  TAC  GTA  CGT  AGG
0  1.0  1.0  1.0  1.0  1.0  1.0  NaN
1  1.0  2.0  NaN  1.0  1.0  1.0  1.0

In [13]:
a = '0123456'

In [14]:
a[1:1+3]

'123'

In [15]:
x, y

(ATG    1
 CGG    1
 ACG    1
 TAC    1
 GTA    1
 CGT    1
 dtype: int64,
 ATG    1
 CGG    2
 AGG    1
 TAC    1
 GTA    1
 CGT    1
 dtype: int64)

In [21]:
pd.DataFrame({'seq1': x, 'seq2': y}).transpose()

      ACG  AGG  ATG  CGG  CGT  GTA  TAC
seq1  1.0  NaN  1.0  1.0  1.0  1.0  1.0
seq2  NaN  1.0  1.0  2.0  1.0  1.0  1.0